# 三引号 如果没有变量接收  """"""作为多行注释存在

info = """你好"""
print(info)

# 转义字符

a = "\"你好\""
print(a)

b = "哈哈哈" + str(123         ) + "hh"
print(b)

print("--"*2)

# 格式化1

message = "我是%s %s" % ("xxx" , "ooo")
print(message)

###

###

# %d %f
#精度控制  %f 默认六位小数点

# 辅助符号 m.n来控制宽度和精度

# m 控制宽度 很少用 设置的宽度小于数字自身 不生效
# n 控制小数点精度 四舍五入

print("%6.3d"%12)
print("%2.2f"%2)
print("%.1f"%2.16) #四舍五入


# 格式化2

name = 13.15
# // f_format
print(f"我是{name: 10.1f}")
# 支持控制精度

# 表达式 格式化

print("%d" % (1*2))

print("%d" % 1 * 2) # "1" * 2 字符串重复两次
print("%d" % 1 * 7)




#####################
print("#####################")
a = "传智播客"
b = "003032"
c = 19.99
print(f"公司：{a}，股票代码：{b}，当前股价：{c}")
print("每日增长系数是：%.1f,经过%d天的增长后，股价达到了：%.2f"% (1.2,7,71.63))



print("#####################")


